{"next_page": 2, "reviews": [{"id": "RAUZXTY0LEK8P", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on November 11, 2020", "date": {"date": "November 11, 2020", "unix": 1605060000}, "name": "Andres G.", "rating": 5, "title": "Great Procesor", "review": "It is the best option in Intel Core I9 cost/benefit.", "verified_purchase": true}, {"id": "R1V3EJ106GVTP7", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on November 6, 2020", "date": {"date": "November 6, 2020", "unix": 1604628000}, "name": "Crystal", "rating": 5, "title": "Same as i9-10900K, but slightly hotter", "review": "This thing runs like a dream!I have it overclocked to 5.3 ghz.Be warned, this thing pumps out heat when pushed to the max.If you're just gaming, the heat isn't a problem.If you are rendering video or performing computational tasks, then you will need VERY good cooling and thermal paste. I am cooling it with the EVGA CLC 360.", "verified_purchase": true}, {"id": "R3A2DJNPDI5MYP", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on November 4, 2020", "date": {"date": "November 4, 2020", "unix": 1604455200}, "name": "Michael White", "rating": 5, "title": "Good match to 3080GPU", "review": "A good choice for building a high-performance gaming computer.", "verified_purchase": true}, {"id": "RAZ77CW1FGM4", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on November 2, 2020", "date": {"date": "November 2, 2020", "unix": 1604282400}, "name": "Jags ", "rating": 5, "title": "The best Gaming/Workstation CPU for competitive gaming and 3D artists", "review": "Let me preface this by saying that I have experience with both AMD and Intel CPU's when it comes to gaming at multiple resolutions as well as workstation uses like 3D modeling, texturing and rendering. With that out of the way I'll try to provide enough information to help both crowds decide if this CPU is worth your money.MY SPECS:Intel Core i9 10850k @5.1GhzG.Skill Ripjaws V DDR4 3600mhz CL16-16-16-39NVIDIA RTX 2080ti Founders EditionMSI Z490 MEGNZXT Kraken X73 360mm AIOEVGA Supernova 850W Modular PSU4TB 860 EVO + 2TB XPG NVMe +1TB Sabrent Rocket 4.0Thermaltake View 51 Full TowerAsus TUF VG27QM 1080p 280hz MonitorGAMING:When it comes to 1080p 240hz gaming as of now, these 10th gen intel CPU's are unmatched for the price. With the announcement of Zen 3, this statement may very well be proven false, but for the immediate time being this is as good as it gets. The counterpart to this CPU would be the Ryzen 3900x and having seen my friends benchmarks in games like Apex Legends, Overwatch, COD MW/Warzone and Valorant, I can reliably say that the i9 10850k/i9 10900k easily achieves higher frames overall. It gets to a point where the i9 10850k can give an additional 20-30+ frames higher in some games when overclocked to 5.1 or 5.2ghz with low latency ram. 1440p gaming narrows the gap a little and will be more GPU bound but again the 10850k will give out 5-10+% higher performance depending on the game title.WORKSTATION USE:As a 3D artist who also likes to play competitive games, it can get a little confusing when you're looking for a CPU that can comfortably provide both experiences flawlessly. From the past PC's I've built, I always favored going for higher core count CPU's in order to have the best experience for my workstation needs. With 10th/11th Gen Intel and Zen 3, the gap narrowed pretty significantly. When it comes to Modeling, Lighting, Texturing and Rendering, I can comfortably say I've had no issues with Maya, Blender, V-Ray, Arnold, Keyshot and several other industry standard applications. The render speeds aren't as fast as the Ryzen counterparts but they get the job done quite well. As with most modern renderer's it'll also rely on your Ram and GPU to keep up with your CPU. I would recommend using an RTX 2070 or above along with DDR4 3600mhz ram with CL16-16-16-39 Timings or better (this is for gaming as well).CONCLUSION:If you want the best mix for high refresh gaming and workstation needs right now, buy this CPU. Otherwise if you can wait a few months, check out the Zen 3 CPU's and compare the benchmarks. As of now I'm very satisfied with this CPU for all my needs and hopefully this review provided enough information to help you decide.", "verified_purchase": false}, {"id": "R17AT0SO2T4E8S", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on November 2, 2020", "date": {"date": "November 2, 2020", "unix": 1604282400}, "name": "TeamMatthewsTransportationLLC", "rating": 5, "title": "10 core i-9 Build Project No.1", "review": "Awesome Speed I built my first computer with th 10 core i-9 Processor on the all new MSI Z490 God Like Motherboard an it came out Great im just waiting for a chance to get the MSI 3090 24GBGraphic Card so I can really test its true power.", "verified_purchase": true}, {"id": "R3F1BLHWW4OU2H", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on October 29, 2020", "date": {"date": "October 29, 2020", "unix": 1603936800}, "name": "Penella Maharaj", "rating": 5, "title": "Great CPU!", "review": "Bought this for a build I'm doing. It is literally a 10900k minus the 100mHz on base & boost frequency. Great value!", "verified_purchase": true}, {"id": "R356XRBC99TXJU", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on October 26, 2020", "date": {"date": "October 26, 2020", "unix": 1603677600}, "name": "David", "rating": 5, "title": "Great value for the cores", "review": "I was contemplating to wait for the amd 5000 series or go with this, and after amd released the prices...I am so glad I got this! This is an excellent cpu. It can handle just about anything you can throw at it and if you are not the overclocking type, thermal velocity boost will give you excellent performance right out of the box. Keep in mind, if you are a casual gamer, non power user, or someone who uses their pc for watching videos on YouTube this is overkill. Go for a zen2 ryzen 5 or 7 and you will be very happy. Also make sure to get a proper cooling solution, as this thing runs HOT!", "verified_purchase": true}, {"id": "R14GBNKCMR5X1I", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on October 20, 2020", "date": {"date": "October 20, 2020", "unix": 1603159200}, "name": "Tyler M", "rating": 5, "title": "SO.. MUCH.. POWER", "review": "(Not OC'd) I'm writing this review based off of my previous CPU experiences with past computers (4790 and 8700k). I have never experienced this much performance for price before.. I am in awe at the difference! I made the mistake of buying my 8700k 3 months before the 9700k came out, and I regretted it ever since. Now that it's been a while, I've gained enough income to afford purchasing an even better CPU that allows me to stream, game, AND watch Youtube (As if that wasn't enough) with no issues at all! I own 3 monitors as I am a multitasker, and this doesn't even sweat with my Castle 280EX cooling it down. I do not game at 4K (Just to save some performance), but I'm sure if you do, there won't be any problems!", "verified_purchase": true}, {"id": "R3MDS623UBUOSP", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on October 20, 2020", "date": {"date": "October 20, 2020", "unix": 1603159200}, "name": "Bobby Blankenship", "rating": 5, "title": "Fast", "review": "my masterliquid 360LR keeps it cool no matter what I’m doing. processor is very fast", "verified_purchase": true}, {"id": "R2JAVI1PP7FMSP", "asin": {"original": "B08DHRG2X9", "variant": ""}, "review_data": "Reviewed in the United States on October 14, 2020", "date": {"date": "October 14, 2020", "unix": 1602640800}, "name": "DirtyHarryJK", "rating": 5, "title": "Great Product!", "review": "Great product works like it should and as described.", "verified_purchase": true}]}