{"next_page": 2, "reviews": [{"id": "RA81P6ZOOQXF4", "asin": {"original": "B08H2CM8R9", "variant": "B08H2CM8R9"}, "review_data": "Reviewed in the United States on November 2, 2020", "date": {"date": "November 2, 2020", "unix": 1604282400}, "name": "Capt. S", "rating": 5, "title": "The seller and the CPU ROCK!", "review": "The CPU arrived in a timely manner and at first glance I was a little dismayed due to the lack of packaging. After a few emails with the seller they put my mind at rest and proved the CPU is indeed new. The box it arrived in was from another product and it was wrapped in paper, which threw me. I gave them my recommendation that the cpu would probably like a better box and protection on the way to its new home. So far bench marking is off the charts! I haven't even OC'd except for the auto click that comes with MSI bios. I have coupled this with an MSI MEG Godlike MB and if you haven't purchased one yet don't waste your money on a lesser board. This cpu deserves the best supporting cast and benchmarking shows 35-45% more performance with with MSi MEG GL over the ASUS ROG Maximus XII Apex. Remember this cpu doesn't have the built in graphics capability which is no big deal since most gamers will use a dedicated gpu. I can highly recommend this seller and their product 5 stars!", "verified_purchase": true}, {"id": "RB51W4SHH8MMG", "asin": {"original": "B08H2CM8R9", "variant": "B08H2CM8R9"}, "review_data": "Reviewed in the United States on October 10, 2020", "date": {"date": "October 10, 2020", "unix": 1602295200}, "name": "cy", "rating": 5, "title": "Intel = gaming/ AMD = Graphic design.", "review": "People don't understand that amd is for design and Intel is for gaming. Intel with out a doubt will always have the best single core performance and if you didn't know this already games don't use more than one core, so if your a gamer get an Intel processor if you only have 2 monitors get an Intel processor, if you have the Adobe suite and you make 1 youtube video a month, get an Intel processor... If you have a digital multimedia technician degree, and you occasionally work from home get and AMD processor it's that simple...", "verified_purchase": false}, {"id": "R2C58PS7FA8K5B", "asin": {"original": "B08H2CM8R9", "variant": "B08H2CM8R9"}, "review_data": "Reviewed in the United States on October 6, 2020", "date": {"date": "October 6, 2020", "unix": 1601949600}, "name": "Tiagan K.", "rating": 1, "title": "3900x is better and cheaper", "review": "3900x would cost 400 dollars plus a 100 dollar b550 motherboard, this is 600 without the 400 dollar motherboard.", "verified_purchase": false}]}