{"next_page": 2, "reviews": [{"id": "R1KSHO41WN5J9F", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZMXK9"}, "review_data": "Reviewed in the United States on November 1, 2020", "date": {"date": "November 1, 2020", "unix": 1604196000}, "name": "RIslander", "rating": 4, "title": "Synology Diskstation NAS - Not exactly as described", "review": "For reference, this is my third Synology NAS.I'm a small business owner that needs a NAS that is reliable, provides remote functionality and easy to setup.These Synology appliances offer all that.I provided an overall rating of 4 stars based the lack of consistency with the product description.I received a Synology DiskStation DS720+ NAS.The machine came with two (2) 2.5\" SSD SATA III P210 hard drives manufactured by Patriot.The machine also came with 8GB of DDR4-3200 SODIMM memory manufactured by Crucial (not 6GB manufactured by Synology).The package does not come with instructions so it took me a little time to realize I had to remove the drive doors on the front of the machine to see where to put the memory, then attach the drives to the NAS removable tracks.My past NAS appliances had memory already installed.The machine seems to run well/fast.It took me a little time for the Synology Migration Tool to transfer all my data/settings from the old to new NAS.I'm hopeful this NAS will be an even better workhorse compared with the 6+ year old DS 713+ machine that was replaced.Although what I received is not what was advertised, everything provided seems to be as good if not better than the stated specifications.I'm just glad that there are two (2) Ethernet ports on the back and a total of two (2) USB ports so I can attach my UPS communication cable on the back and external docking station for backup on the front.", "verified_purchase": true}, {"id": "R143BKO6N60S7", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZHGYN"}, "review_data": "Reviewed in the United States on June 18, 2020", "date": {"date": "June 18, 2020", "unix": 1592445600}, "name": "Jennifer Taddiken", "rating": 5, "title": "Does exactly what I need it to do.", "review": "Something happened to my husband's computer yesterday, but he was able to recover everything with ease. He said the Synology made it easy and hassle free.", "verified_purchase": true}, {"id": "R49FK7UCQDR56", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZMXK9"}, "review_data": "Reviewed in the United States on June 3, 2020", "date": {"date": "June 3, 2020", "unix": 1591149600}, "name": "Steve", "rating": 5, "title": "Works great and was easy to install.", "review": "I have limited experience with NAS installation, but with the help of the built - in applications and YouTube guidance, I was able to do a quick and painless installation.I am a small company that has several remote workstations. We use Dropbox for primary file storage and sharing. Synology has an application for the DiskStation that automatically syncs with Dropbox to backup all modified files.We now have a level of redundancy that I am very comfortable with. There are many more applications that can be used that I intend to explore.", "verified_purchase": true}, {"id": "R1RN023WUYAG2C", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZHGYN"}, "review_data": "Reviewed in the United States on May 28, 2020", "date": {"date": "May 28, 2020", "unix": 1590631200}, "name": "Adam J.", "rating": 4, "title": "Easy to set up and lots of functionality", "review": "Purchased the package that included the DS718, SSD hard drives, and memory. Installation was fairly straightforward, and I’ve used it to create a file and picture/video server for our home network.It took a day and a half to transfer about 600gb from several external hard drives. Once you get the hang of navigating the folders and how it behaves when copying files you can be a bit more efficient with the process. There are several apps, and although I haven’t had much time to dive in, it appears the DS Photo and Memories apps function very similar to iCloud photo roll. I’ve set it to back up from my iPhone automatically. The AI face recognition seems pretty accurate so far. So far, so good!", "verified_purchase": true}, {"id": "RYOY3FHGPUY1G", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZP4BP"}, "review_data": "Reviewed in the United States on April 14, 2020", "date": {"date": "April 14, 2020", "unix": 1586829600}, "name": "Andrew E. Williamson", "rating": 5, "title": "If you're in the market for a NAS buy this product.", "review": "Best computer purchase I have made in years!If best product was stolen the next day I would buy another one.", "verified_purchase": true}, {"id": "R3QABA4IA05UKM", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZL122CP"}, "review_data": "Reviewed in the United States on February 28, 2020", "date": {"date": "February 28, 2020", "unix": 1582855200}, "name": "Bill in NH", "rating": 4, "title": "Better Documentation?", "review": "Overall, I really like this product. I purchased it with two preinstalled SSDrives so most of the hard work was already done.I'm using it to replace an existing NAS drive and I might set it up as a media server in the future.It would have received a full 5-star rating if it came with decent instructions. If I didn't have at least a basic knowledge of how to set it up and where I might go to find some direction, the whole process would have taken much longer and been a lot more frustrating. It is capable of doing much more than I have it set up to do and hopefully, I'll eventually figure out how to take advantage of some of those things.Yes, I would recommend it to a friend.", "verified_purchase": true}, {"id": "R2I6ETSTBRDYVR", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZHGYN"}, "review_data": "Reviewed in the United States on February 19, 2020", "date": {"date": "February 19, 2020", "unix": 1582077600}, "name": "john frick", "rating": 5, "title": "Easy to set up as a music server", "review": "I am a non-technical user and was able to set this up as a network attached storage device for music, rip CDs to it, and have it appear as my music library in the bluos operating environment.My preparation was to read the directions and review other feedbackIt was no big deal to make it work", "verified_purchase": true}, {"id": "R14UIV4H7ALZUS", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZL122CP"}, "review_data": "Reviewed in the United States on February 10, 2020", "date": {"date": "February 10, 2020", "unix": 1581300000}, "name": "Craig2019", "rating": 5, "title": "Affordable and fast NAS unit", "review": "Unit arrived quickly and was easy to set up. DSM browser-based management tool is a pleasure to use. Got up and running in minutes and was copying data from existing NAS unit. Haven't deployed it as a primary NAS yet but will be doing so in the next few days. I like everything about this unit; I will probably buy additional ones.", "verified_purchase": true}, {"id": "R11DFDFIRWQ4LH", "asin": {"original": "B07ZKZHGYN", "variant": "B07ZKZMXK9"}, "review_data": "Reviewed in the United States on February 2, 2020", "date": {"date": "February 2, 2020", "unix": 1580608800}, "name": "ds0ocx", "rating": 5, "title": "This a pre-configured Synology DS718+", "review": "I bought this because it is a pre-configured DS718+ . The seller installs the memory, SSD'S and the latest edition of the OS all for a very reasonable price. The DS718+ was ready to use out of the box.", "verified_purchase": true}]}