{"next_page": 2, "reviews": [{"id": "R12R7P19QZPNTW", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on October 6, 2020", "date": {"date": "October 6, 2020", "unix": 1601949600}, "name": "Matthew", "rating": 5, "title": "Great", "review": "Had no problem and works with computer and works great.", "verified_purchase": true}, {"id": "R201A2UK3S5CPT", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on May 23, 2020", "date": {"date": "May 23, 2020", "unix": 1590199200}, "name": "MalibuK8", "rating": 3, "title": "CHECK SEGFAULT", "review": "I was so excited to have my 1700 clock to 4GHz out of the box @ 1.337V. I basically won the lottery! Come to find out almost a year later, when it is time to start doing actual production work, and using GCC; It is SEGFAULTing. This chip is completely USELESS under linux. Segfault is no big deal, they'll RMA it right? WRONG.I heard they had a super easy RMA process; this could not be further from the truth. If you're unlucky enough to get a SEGFAULT chip, AMD will force you to pay the $100+ return shipping on a $300 chip. No compensation for the inconvenience; I surely won't get an equal replacement. Not to mention I have to disassemble the PC, throw$35 of paste out the window, wait several days-weeks of downtime, and reassemble the system using new paste (good paste can be cheap, but @ 4GHz it is not.) There is absolutely ZERO consideration for the affect of this process on their customers.I have been on team red since before the launch of the Opteron in early 2000-something? I have never had much issue aside from TPM modules on intel platforms; the TPM is easily locked, however. I have preferred the lack of an embedded backdoor in my AMD chips for years, unfortunately this is no longer the case with AMD either. Very sad to see both manufacturers jump into the same boat on this one. AMD is quickly proving that you \"get what you pay for\". We will be using Intel for our critical workloads going forward, until Cyrix comes back into the fray, or a proper CPU manufacturer emerges from the dust.I wonder, does IBM still make the POWER chips? I'd definitely consider using ISA again if it meant our labs were stable and capable of any COMPUTER PROCESSING at all, something my Ryzen chip can only seem to EMULATE.TL;DR:All in all buying a Ryzen chip was a waste of $1200 for the platform; an additional $200 in replacement cost, add to that $3000+ worth of downtime on the system. At the end of the day I didn't save any money over Intel when it was all said and done, thanks to SEGFAULT, and poor quality control. If you only want to use windows, and play games, you won't notice it much aside from the occasional BSOD; but the 9400F fits the bill in that case on a much lower budget. If you're doing actual PRODUCTION workloads, or want your computer, to do computer things; look elsewhere.", "verified_purchase": true}, {"id": "R12U1X2IL2G9PB", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on May 4, 2020", "date": {"date": "May 4, 2020", "unix": 1588557600}, "name": "Jordan Thomas", "rating": 5, "title": "She runs like a dream!", "review": "Going on 4 years and still running like a dream, been the best bang for my buck ever since!", "verified_purchase": true}, {"id": "R367T3SU60U88Z", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on April 16, 2020", "date": {"date": "April 16, 2020", "unix": 1587002400}, "name": "wm dins", "rating": 5, "title": "have not had a problem", "review": "runs well, with the video card and motherboard, I have paired with it,no problems running heavy graphics during games", "verified_purchase": true}, {"id": "R2F2JIBCG8MXUZ", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on January 21, 2020", "date": {"date": "January 21, 2020", "unix": 1579572000}, "name": "Honest Reviewer", "rating": 3, "title": "Came bent!", "review": "Bought my parts little by little sincr Im new to PC building and buying all at once is expensive. I bought my cpu first since its most expensive and a year later I finally have all my parts to build and my CPU, 2 pins were bent and my fan looked used!!I would’ve returned but I was way past the return policy. Im having to use a CPU Im not confident in but my PC’s running after fixing the pins, so we’ll see.I should’ve bought Intel.", "verified_purchase": true}, {"id": "RH18L7M6WJJ1Q", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on December 9, 2019", "date": {"date": "December 9, 2019", "unix": 1575856800}, "name": "Hayden Mills", "rating": 4, "title": "Amazing processor for the price even in 2019-2020", "review": "This is a great processor the wraith cooler keeps it at a constant cool 35-38° and it runs most modern games in 2019.", "verified_purchase": true}, {"id": "R1JGFWCNKODDWO", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on October 26, 2019", "date": {"date": "October 26, 2019", "unix": 1572055200}, "name": "MobIT Small Business Solutions, LLC", "rating": 5, "title": "A real workhorse.", "review": "Used it for a gaming PC for a year with a very nice configuration, worked flawlessly. Upgraded and turned this into a Plex/Media server for 8 televisions, never an issue, fast decodes/transcodes.No problems to date. Paired with Corsair H80i and overclocked to 3.9 on all cores for the last two years now.No issues", "verified_purchase": true}, {"id": "RN099BOZIGYEN", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on October 19, 2019", "date": {"date": "October 19, 2019", "unix": 1571450400}, "name": "Laura Winters", "rating": 5, "title": "Gaming son", "review": "Son very pleased", "verified_purchase": true}, {"id": "R3HWPECCHVLCN1", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on October 17, 2019", "date": {"date": "October 17, 2019", "unix": 1571277600}, "name": "Travis Tate", "rating": 5, "title": "Good price and a fast processor", "review": "Built my PC with this and my computer is fast and the price was good.", "verified_purchase": true}, {"id": "R3PXRZ4O8HFV34", "asin": {"original": "B06WP5YCX6", "variant": "B06WP5YCX6"}, "review_data": "Reviewed in the United States on August 31, 2019", "date": {"date": "August 31, 2019", "unix": 1567216800}, "name": "CJ", "rating": 5, "title": "Great CPU", "review": "I really really like this CPU. Works perfect and runs super fast. Haven't had any trouble. Also overclockable.", "verified_purchase": true}]}