{"next_page": 2, "reviews": [{"id": "R2BT84MTKTNSSL", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "mike892", "rating": 5, "title": "compiles are done immediately.now my ssd is the bottleneck", "review": "Very expensive but my compiles are fast and ... done.Looking back I probably could have gotten the fastest SSD and a slightly cheaper CPU.But since this system will last me for 5-10 years, I can work on that in a year or two.", "verified_purchase": true}, {"id": "R2G7AC2LTAQ1GS", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "50shadesofnick", "rating": 5, "title": "its great", "review": "Well balanced great speed.Average Heat of the CPU when in idle is 34C and when im doing video work and designing my games it tops out at 50C.No need for liquid cooling.", "verified_purchase": true}, {"id": "R3DBD8DGP64RI9", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on November 7, 2020", "date": {"date": "November 7, 2020", "unix": 1604714400}, "name": "Amazon Customer", "rating": 4, "title": "Stable multithreading Maya rendering", "review": "I built a machine around this processor to render 8K Maya VR. It works as advertised, stable for days on end as if plows through the Maya workload. 32 cores are nice but in retrospect, I wish I had purchased the 64 core version. I also run a very fast Intel i9 machine and this processor beats the i9 for Maya rendering with Arnold renderer.", "verified_purchase": false}, {"id": "R1Y2SFOG1G8DAT", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on November 1, 2020", "date": {"date": "November 1, 2020", "unix": 1604196000}, "name": "SAMC", "rating": 5, "title": "Powerful CPU", "review": "The best cpu I have ever owned. Super fast and make my work done faster .Without pbo the noctua tr4 sp3 u14 cooler can keep this cpu under 70c with load nicely", "verified_purchase": false}, {"id": "R1OB7VB49LCJEP", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on October 2, 2020", "date": {"date": "October 2, 2020", "unix": 1601604000}, "name": "Dallas Crane", "rating": 5, "title": "Easy to install, Goldilocks pricing", "review": "Make sure to use Honey or Camelcamelcamel to watch for lowest price. This is the best of the 3rd-gen Threadrippers. 3990x is too expensive for the extra cores and the other ones are underpowered for their price.", "verified_purchase": true}, {"id": "RGIF76C2U3EB", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on September 29, 2020", "date": {"date": "September 29, 2020", "unix": 1601344800}, "name": "edward", "rating": 5, "title": "Good For Workstation Use", "review": "I use this for my workstation and have a custom loop with proper cooling. Temps under idle sit around 34c and under load haven't gotten higher than 64c for me. This keeps the processer boosting higher at 4.6 on all cores than the advertised 3.7 and saves me a bunch of time in my work as a creator allowing me to improve my work and iterate many times faster than I could ever before.", "verified_purchase": true}, {"id": "R2TPSIGJYDCDXA", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on September 14, 2020", "date": {"date": "September 14, 2020", "unix": 1600048800}, "name": "IST Engineering", "rating": 5, "title": "Reliable and fast", "review": "Been using this 3970x for over 4 months.Using Noctua NH-U14S TR4-SP3 air cooler with 2 fans and it is rare that temps get above 81 C, generally low 70's for most of my work.I do a ton of CAD, meshing, and CFD with this working away sometimes for several days 24/7 and it has never skipped a beat.The build it is in has been workstation reliable.Compared to an Epyc, these new Threadrippers clock higher, but they lack L3 cache to some Epyc versions, and of course, 256 GB RAM is about it whereas Epyc's have motherboards that can take between 1 and 2 TB, which is a necessity for some types of engineering codes like CFD of large models.However, it's still hard to beat the workstation-like reliability and processing power that these new Threadrippers have, provided the memory and cache aren't limiting factors.", "verified_purchase": true}, {"id": "R15155L39XHMTO", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on August 31, 2020", "date": {"date": "August 31, 2020", "unix": 1598839200}, "name": "Kenneth Bauman", "rating": 5, "title": "The best and fastest CPU'S", "review": "If you build gaming computers, as I do, then you will have to use AMD Thread Ripper CPUs, because there isn't anything out there that can compete with them, as of now.They are very expensive I know, but if you want to play, then you better be ready to PAY!", "verified_purchase": true}, {"id": "RVP1B8TNIFTWG", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on July 21, 2020", "date": {"date": "July 21, 2020", "unix": 1595296800}, "name": "Chris", "rating": 5, "title": "Some thoughts...", "review": "Bought mines from micro-center.It runs my minecraft server pretty well, however I don't think the max limit of 256GB RAM is enough.Should have gone with Epyc so I can have 2TB of dedicated RAM.On a serious note though, with the 32 cores and 64 threads and 256GB of RAM is more than enough in my use case, I am able to run multiple virtual machines at high performance via QEMU/ KVM.Some vms I run simultaneously include a 2x windows gaming machine using pci-e passthrough, FreeNas, Apache Guacamole, MineOS, PopOS, ReverseProxy, NextCloud, OpenVPN, PFSense, Email-Server, Android Emulator, and a Test Website.All without breaking a sweat.The only issue I've come across is with nested vm with hyper-v enabled in a windows guest.I am not sure if this issue is due the hypervisor enlightenment not being entirely functional for qemu with AMD since I have not attempted to use ESXi or Xen.I can definitely recommend for a homelab hobbyist use case.", "verified_purchase": false}, {"id": "R17W62967M4PUR", "asin": {"original": "B0815JJQQ8", "variant": "B0815JJQQ8"}, "review_data": "Reviewed in the United States on July 16, 2020", "date": {"date": "July 16, 2020", "unix": 1594864800}, "name": "Amazon Customer", "rating": 5, "title": "3D Artist Approved", "review": "Great Cpu would buy over intel at this price point. Your dollar goes much further. R20 scores around 17k. Runs every piece of 3D software I use on a daily basis.", "verified_purchase": true}]}