{"next_page": 2, "reviews": [{"id": "R28974HR74UGLP", "asin": {"original": "B07N17HZN2", "variant": "B07N9K44Y8"}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "Austin Fox", "rating": 5, "title": "Cooler temps!", "review": "I have the two fan non-argb version of this and added this one as the other one was starting to make a little noise in the pump and this one keeps my processor roughly 10° cooler than the two fan version. Very happy!", "verified_purchase": true}, {"id": "RE6PRD6KI297Z", "asin": {"original": "B07N17HZN2", "variant": "B07N9K44Y8"}, "review_data": "Reviewed in the United States on November 5, 2020", "date": {"date": "November 5, 2020", "unix": 1604541600}, "name": "Mark", "rating": 4, "title": "Good Product but bad RGB Software", "review": "Good product but the RGB Software is lacking badly. Thermaltake has some of the worst software I have ever used for RGB. It is not only ugly but confusing to use. Besides the RGB software it is a good product and I would purchase it again. I use it for my 10850k and it keeps my temps cool and I have never heard the fans.The thermaltake fans can be annoying to set up because of how long the cables are and how it looks like a birds nest unless you do a really well thought out cable run through the pc with good cable management. I had to redo my cable runs twice for me to be happy with the looks.I didn't leave a rating for Warmth because I am not sure what that is supposed to mean. It keeps my temps down so if that is what they mean it does well.", "verified_purchase": true}, {"id": "R12AEV256POUWG", "asin": {"original": "B07N17HZN2", "variant": "B07NB3W6LL"}, "review_data": "Reviewed in the United States on October 25, 2020", "date": {"date": "October 25, 2020", "unix": 1603591200}, "name": "Max", "rating": 5, "title": "quality", "review": "work very well", "verified_purchase": true}, {"id": "RP8GVW957DDYP", "asin": {"original": "B07N17HZN2", "variant": "B07NB3W6LL"}, "review_data": "Reviewed in the United States on October 23, 2020", "date": {"date": "October 23, 2020", "unix": 1603418400}, "name": "Simpsonslover1988", "rating": 4, "title": "Does what it needs to", "review": "I had to lower the power to my i9 10850K otherwise it would reach 95 degrees Celcius. Once I did that, this cooler keeps my CPU at 67 degrees max.", "verified_purchase": false}, {"id": "R3B1Y1OKHDC0JP", "asin": {"original": "B07N17HZN2", "variant": "B07N17HZN2"}, "review_data": "Reviewed in the United States on October 15, 2020", "date": {"date": "October 15, 2020", "unix": 1602727200}, "name": "Nigel Tufnel", "rating": 1, "title": "Pretty, noisy", "review": "I can't tell you all how much I wanted to like this AIO cooler.It is my 4th probably.The LED's and fans work as described. The issue was the bubbling nature of the water pump.No amount of shaking or tilting would get rid of the flapping.Also, the fans were still a noise issue when my 65W CPU was stressed.I've switched to a custom AIO build with a deep radiator, Cooler Master scythe fans and it's about 5 degrees cooler and dead silent.", "verified_purchase": true}, {"id": "R3JXSD60TD9VUH", "asin": {"original": "B07N17HZN2", "variant": "B07N17HZN2"}, "review_data": "Reviewed in the United States on September 16, 2020", "date": {"date": "September 16, 2020", "unix": 1600221600}, "name": "Clayton Terral", "rating": 3, "title": "I hoped for better", "review": "So far works well I guess. Doesn’t really seem to cool any better than when I was air cooled but I don’t over heat so it works. It says it’s 3600 rpm but my motherboard and software I use have only ever read 1700-1800 rpm at 100% output, not sure if this just a weird design issue or if that’s what it actually runs at. Biggest dislikes are the lack of their own software for the pump control and the fans have different connections than other thermaltake fans I purchased so a extra interface was required to get all the lights to sync.", "verified_purchase": true}, {"id": "R300P231IINZL7", "asin": {"original": "B07N17HZN2", "variant": "B07N9K44Y8"}, "review_data": "Reviewed in the United States on September 15, 2020", "date": {"date": "September 15, 2020", "unix": 1600135200}, "name": "Frank", "rating": 3, "title": "Wonderful.. except for the RGB", "review": "I purchased this model in 12/2019 from a competing triple-egg website.WARMTH:This AIO does a great job keeping my CPU temperatures in check. It performs as well as you might expect from an Asetek.INSTALLATION:The unit was easy to install. The headers have a proprietary shape that makes it clear which way they should be plugged in.NOISE:There is a gentle hum from the pump if I bring my head within 6 inches of the case. I have a closed case, so I don't notice any sound from my usual distance (2 feet from my computer case) when I'm sitting normally. I only really hear the fans/pump for the first 5 seconds running at 100% when I turn on the PC.ARGB:The lights looked great! Until they malfunctioned after 6 months. The lighting on the pump is off-colored. It can no longer display uniform colors except for green. The attached picture is what happens when I have the color set to white. I believe the red/blue lights in the top portion of the pump have stopped working, as the pump has no problem displaying green. Every other color setting for the top portion of the pump will either flash green or not light up at all.The fans that came with the AIO are great. I don't hear them, the colors are vibrant, and the airflow is strong (based on sticking my hand behind the fans).I am satisfied with every part of this cooler except for the broken ARGB in the pump. My decision to pay the price premium for this AIO over its competitors was based solely on the ARGB feature. Similar performing 360 AIOs without ARGB can be had for roughly 2/3 of the price of the Thermaltake 360 ARGB Sync. Two stars were removed because that is roughly the value of the ARGB that stopped working for me. This product earned three stars because its performance is fine. Overall, I would not recommend purchasing this for the ARGB feature, as the longevity of that feature was short-lived for me.", "verified_purchase": false}, {"id": "R1GG2Q3YHN957D", "asin": {"original": "B07N17HZN2", "variant": "B07N9K44Y8"}, "review_data": "Reviewed in the United States on September 8, 2020", "date": {"date": "September 8, 2020", "unix": 1599530400}, "name": "Nick Eubanks", "rating": 5, "title": "This is one of the best AIO coolers available", "review": "I had to replace my previous AIO due to a radiator leak and based on the reviews ordering this one. It looks awesome and the fans are basically silent. The pump itself extremely quite when run at 100%. On that note, be sure to configure the fan connector this plugs into on the motherboard to run at 100% always. If you let the MB throttle based on CPU temperature or usage the pump will be extremely noisy (these AIO typically aren't designed to run at variable rates). My previous cooler didn't actually connect this way so I never had to bother.", "verified_purchase": true}, {"id": "R1J26RSKI4JG8I", "asin": {"original": "B07N17HZN2", "variant": "B07N17HZN2"}, "review_data": "Reviewed in the United States on August 23, 2020", "date": {"date": "August 23, 2020", "unix": 1598148000}, "name": "Andy", "rating": 1, "title": "Bought all Thermaltake products", "review": "Case, AIO, Power supply, etc. The are impossible to get to work properly, no ARGB for me :(", "verified_purchase": true}, {"id": "R2F6DYJZXKGHB8", "asin": {"original": "B07N17HZN2", "variant": "B07WF72JZT"}, "review_data": "Reviewed in the United States on August 14, 2020", "date": {"date": "August 14, 2020", "unix": 1597370400}, "name": "Steven", "rating": 1, "title": "Avoid. Avoid.", "review": "Purchased this “brand new”.Didn’t realize until getting my mobo in, this has been used.Thermal pads on the bracket are gone as seen in photo 2, cables are sticky as if they have thermal paste on them.I was under the impression the cooler had pre applied thermal paste... clearly not the case.Last time I ever buy from them.", "verified_purchase": true}]}