{"next_page": 2, "reviews": [{"id": "R3LCEFP225OWZJ", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on October 29, 2020", "date": {"date": "October 29, 2020", "unix": 1603936800}, "name": "Patrick R Cannon", "rating": 5, "title": "Fast!", "review": "Fast. Fast. Fast.", "verified_purchase": true}, {"id": "REDJMNI9IGQQD", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on September 20, 2020", "date": {"date": "September 20, 2020", "unix": 1600567200}, "name": "Kyle", "rating": 5, "title": "A year in and is still amazing!", "review": "Your browser does not support HTML5 video. I bought this when it was on sale for $900 (that still hurts thinking it was 'on sale' at that price). I was skeptic, but man, was it money well spent. This machine is a beast. I run a software company from my home, write programs, use AutoCAD and enjoy video games. This processor handles everything. Many times I need multiple computers to test different operating systems for my products. This processor can handle everything I have thrown at it, without even one single time of slow down in a year! One time, I was running five different operating systems IN THE BACKGROUND for a week, and didnt notice. I also believe, in that year time, I have only turned off my computer about 24 hours total. The only time it is shut down is for required updates, which takes one restart, and then it is back up.The only downside I had with this processor was there was no clear instructions on how to install it. There are two sleeves on this processor, and I thought there was only one. It took me a while of saying, 'Why doesnt this fit?' before I realized I had to REMOVE the outer sleeve and KEEP the inner sleeve. Made no since. But, it worked out in the end.I cannot express how happy this processor has made me. This processor is well worth the money.", "verified_purchase": true}, {"id": "R31D0Y64G3OYHH", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on April 13, 2020", "date": {"date": "April 13, 2020", "unix": 1586743200}, "name": "Robert Brubaker", "rating": 5, "title": "Great for rendering animation.", "review": "I purchased this processor for rendering animation. Great value for the money.", "verified_purchase": true}, {"id": "R23UWPJCH63JPN", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on March 3, 2020", "date": {"date": "March 3, 2020", "unix": 1583200800}, "name": "O", "rating": 5, "title": "Perfect for zoneminder build:", "review": "Works great for a 12 x POE IP camera Zoneminder server build running Debian.Only downside is at the time the motherboard selection was limited for server purposes.I had to settle with a dumb flashy gaming oriented motherboard to pair with this 24 core CPU.Will probably replace the motherboard later with better options on the market.", "verified_purchase": true}, {"id": "RUSL8SNDXTFBP", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on October 1, 2019", "date": {"date": "October 1, 2019", "unix": 1569895200}, "name": "George Gavaghan", "rating": 5, "title": "Can you feel the power?", "review": "Just got my build finished, but have only been able to perform some basic tests and benchmarks, including some computational intensive applications (DAZ and BOINC).This CPU is so fast and powerful that even when DAZ is presented with > 4000 CUDA cores (RTX 2080 Ti), and given the choice, it will use the CPU exclusively.(Manual bench-marking in DAZ shows CPU-only and GPU-Only to be virtually identical, and using combined CPU+GPU is only marginally faster (~3%)).As for BOINC, it will take several days for the numbers to average out, but initial results are showing that this 24-core Threadripper at 25% (using 50% of the CPUs, 50% of the time) is WAY out-performing my i7 3770K at ~56% (75%, 75%), which isn't that much of a surprise since it has more than 5x the total processing power.", "verified_purchase": true}, {"id": "R1MI4Q6QN43ZD4", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on September 11, 2019", "date": {"date": "September 11, 2019", "unix": 1568167200}, "name": "Jonathan Ball", "rating": 5, "title": "Windows only using half of the cores.", "review": "This is one great CPU it can handle just about anything that you can throw at it. But windows has a problem where it only uses half of the cores but linux works great but make sure you have a good cooler if your going to be using it for linux due to it ramping up it does get hotter then windows.", "verified_purchase": true}, {"id": "R2SOMX7V90SND", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on August 23, 2019", "date": {"date": "August 23, 2019", "unix": 1566525600}, "name": "Colin", "rating": 5, "title": "Monster", "review": "What a processor do whatever you throw at it", "verified_purchase": true}, {"id": "R356NLCN02J5DK", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on March 8, 2019", "date": {"date": "March 8, 2019", "unix": 1552010400}, "name": "Robert Nendel", "rating": 5, "title": "Easiest install ever", "review": "I've been putting together computer systems for 30 years.The Tr4 socket has to be the absolute simplest install I have ever experienced.Hands downthe most professional socket out there in the consumer realm - adding water or an air cooler is a breeze, no compressing, no stress, just slip on and fold down - a dream to install.Insofar as the CPU goes , well, I am studying for my VCP *(VMware certified professional) and with 24 cores I can easily fit an entire virtualized datacenter on the system, running under VMware workstation - all at once.24 cores, 48 threads is simply insane in the consumer space - this processor is well worth the money.", "verified_purchase": true}, {"id": "R6H3XERP1QNLW", "asin": {"original": "B07JBQJ1D9", "variant": "B07JBQJ1D9"}, "review_data": "Reviewed in the United States on February 24, 2019", "date": {"date": "February 24, 2019", "unix": 1550973600}, "name": "HJM", "rating": 5, "title": "Perfect for my professional CAD workstation!", "review": "It was easy to install with fan, etc.Great product for very affordable price.Highly recommend to everyone!!", "verified_purchase": false}]}