{"next_page": 2, "reviews": [{"id": "R9LNA1KKDPCCO", "asin": {"original": "B07SXMZLP9", "variant": "B07ZLFHZ88"}, "review_data": "Reviewed in the United States on November 13, 2020", "date": {"date": "November 13, 2020", "unix": 1605232800}, "name": "Dan", "rating": 5, "title": "Beast of a processor, even though 5900x and 3900xt are avaible this is still a great option.", "review": "The 5900x may be a significant amount faster but the 3900x is still much faster than most people will need for the foreseeable future. So if your search for a 5900x comes up fruitless fear not the 3900x is still a beast.", "verified_purchase": true}, {"id": "R2FEIPQL5ZBM96", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 13, 2020", "date": {"date": "November 13, 2020", "unix": 1605232800}, "name": "Jimmy Suarez", "rating": 5, "title": "is fantastic price", "review": "es super rapido es perfecto para juegos", "verified_purchase": false}, {"id": "R2MYOFH5BET4E1", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 13, 2020", "date": {"date": "November 13, 2020", "unix": 1605232800}, "name": "DublinDown", "rating": 5, "title": "Great if you know what you're doing", "review": "I went from an i5 and i7 to this. The first thing I noticed was this CPU runs much hotter and the fans were much louder. That is until I went in and tweaked voltage and set up some custom profiles via Ryzen Master. Now the only time I ever hear the fan is when you expect to hear it. I threw a 4K HDR 60fps game at it with no issues. Works great so far on WIN 10 with all kinds of apps (photoshop, after effects, premiere, blender, maya) and some of the latest games. This CPU combined with the latest SSD and an RTX GPU is a realy beast of a setup. Best upgrade to my CPU since my original i7 purchase years ago. I'm also using the stock fan and my CPU temps hover at 40 degrees while casually using the computer. The highest I've seen it go is 78. Ended up using arctic silver paste instead of the included paste, though.", "verified_purchase": true}, {"id": "R32UYXPILE6D7S", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "Victor Van Geem", "rating": 5, "title": "Monster!", "review": "AMD went above and beyond with this CPU. Have had this cpu in my system for 3 months and I couldn't be happier. Perfect for any work that requires more cores as well as gaming in general. Won't be upgrading anytime soon. Very pleased.", "verified_purchase": true}, {"id": "RW8FEJWQPFQ8J", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "JJ Oliver", "rating": 5, "title": "Ryzen is always the best option for gaming and workstation PCs", "review": "So I have stuck with AMD since they released their Ryzen series CPUs. Back in the day (pre 2000 and into early 2000s) I used the Athlon processors exclusively. Eventually switched to Intel processors, and since about 2016 have stuck with AMD Ryzen exclusively. Every time I upgrade I am happy I decided to stick with them.I overclocked this Ryzen 9 3900x which I overclocked to 4.2ghz (able to go to 4.5 but haven't tested that out yet).Just as with my last Ryzen 7 2700 that was overclocked for the 1.5 years I used it it has been incredibly stable. I do not use the wraith cooler, I have a dual chamber water cooler as these CPUs run a bit hotter than the Ryzen 7 (8 core) CPUs - of course I used a water cooler with that as well due to overclocking.You could get away with the cooler and overclocking possibly but it is best just to use the water cooler just in case.The processing power is incredibly. I have it coupled with a 2080ti and 32 gigs of 3200mhz ram. I do video editing, graphics, and sound editing for work. Heavy CPU and graphics card usage in those processes and this computer runs perfectly. I would stack this against any intel chip in the same range... this one beats it in speed and price.In Ryzen Master software currently it is fluctuating between 36 degrees C, and 38.6 degrees. With my Ryzen 7 2700 which was overclocked to 4 ghz and with my other water cooler (single chamber) it was usually between 24-30 C. so we added 4 more cores, and more power per core. I have not noticed a significant increase while running games/software but the limit is 95 degrees C so it is not really something you need to worry about.I highly recommend this CPU. This is expensive when looking at CPUs like the Ryzen 7 2700x and similar, but 430 dollars or whatever it was is well worth it. My old PC (which has been rebuilt and still has a GTX 1070) is still a modern PC that is capable of a lot and this current one will be for several years really. Short of upgrading the video card to the 3090 within the next year (maybe)I do not foresee any real need to upgrade the CPU for at least 3-4 years.As far as money goes - sometimes we need to be reminded of perspective. My fiance was getting a laptop the other day and wanted to spend 500-650 max. She is a traveling medical worker. So a laptop will be very important to her and used a lot as she goes from city to city. So I explained that we drop upwards of 1000 dollars or more on our phones every 1 to 2 years without much thought at all. yet when we are buying electronics that will need to have a lot of power and hold up and be used as much or more we get very cheap. I spent 2000 dollars on a laptop back in 2012 and have upgraded it here and there (ram and hard drive) and it still runs extremely well. I use it for a lot of things. Had I spent 500 dollars it would have been useless by now.So if you have the means, do not cheap out and buy a 300 dollar option for your CPU - you will end up spending that much or more very soon. Always buy beyond what you need when building a PC if it is doable for you. I have had systems that ran flawlessly for many years, and ones that played the latest games at high settings with decent FPS, and ran adobe software wonderfully.I will update this review when I test an OC of 4.5 ghz and give you the details on cinebench for both the 4.2 and 4.5 OC.", "verified_purchase": true}, {"id": "R3VKPRMRTDL5GA", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "Matthew Martin", "rating": 5, "title": "Runs great", "review": "Runs amazing. Haven’t had any issues with it. Posted a benchmark after install. Processor is water cooled. Runs like a beast.", "verified_purchase": true}, {"id": "RZG39HONV24QR", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 9, 2020", "date": {"date": "November 9, 2020", "unix": 1604887200}, "name": "bobtrude", "rating": 4, "title": "Damaged packaging and seems used but works as intended.", "review": "This CPU and its' performance are beautiful, but there is one issue. The packaging inside the box came torn up and the CPU had markings on the top of it. I thought nothing of it and decided to keep it. I'm still unsure if it had been used.", "verified_purchase": true}, {"id": "R38RW0GWAD8BFK", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 9, 2020", "date": {"date": "November 9, 2020", "unix": 1604887200}, "name": "Tyler", "rating": 4, "title": "Hot", "review": "Very powerful cpu works great get very hot so get a high end cooler to compliment it", "verified_purchase": true}, {"id": "R2RLB6ZN1BZ15D", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 9, 2020", "date": {"date": "November 9, 2020", "unix": 1604887200}, "name": "Randall C. Page", "rating": 5, "title": "Excellent!", "review": "\"Wow\", that covers it...:)", "verified_purchase": true}, {"id": "R8K125LFAZMO6", "asin": {"original": "B07SXMZLP9", "variant": "B07SXMZLP9"}, "review_data": "Reviewed in the United States on November 9, 2020", "date": {"date": "November 9, 2020", "unix": 1604887200}, "name": "joseph", "rating": 5, "title": "Sorry intel.", "review": "So many cores makes money printer go BRRRRRRRRRRRR.", "verified_purchase": true}]}