{"next_page": 2, "reviews": [{"id": "R1HHVNT1TENESM", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on November 10, 2020", "date": {"date": "November 10, 2020", "unix": 1604973600}, "name": "Dave", "rating": 3, "title": "Cooling needs work.", "review": "15 minutes of Civilization V caused the PC to get too hot and blue screen (many times), taking the side glass allows it to get enough air to keep going past 15 minutes.I had it on 2\" spacers and a hard surface and tried adding a top fan which didn't help.Will have to get a different case.", "verified_purchase": true}, {"id": "R1N45K01QO4NLG", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 30, 2020", "date": {"date": "October 30, 2020", "unix": 1604023200}, "name": "Ron Crandall", "rating": 4, "title": "Great price for a prebuilt and the parts", "review": "Small scratch that went through the plastic cover into the tempered glass on arrival. Otherwise, the computer works like a charm right out of the box, didn't even need to re-seat any of the cards.", "verified_purchase": true}, {"id": "R3T1TDU2ZB3MMK", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 29, 2020", "date": {"date": "October 29, 2020", "unix": 1603936800}, "name": "Daniel Wetzel", "rating": 5, "title": "As advertised", "review": "Just got my new Cyberpower pc, and so far it is working flawlessly.", "verified_purchase": true}, {"id": "R3FP9G6M34BIQF", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 26, 2020", "date": {"date": "October 26, 2020", "unix": 1603677600}, "name": "Chris Maser", "rating": 1, "title": "DO NOT BUY FROM CYBERPOWER PC!!!", "review": "DO NOT BUY FROM CYBERPOWER PC, BUY LITERALLY ANYWHERE ELSE!!!I purchased from this company directly back in 2012. Overall, the experience wasn't \"terrible\" but I did have some issues. Enough to note, but not enough to not try them out again in 2019. This has been my worst customer service experience to date.I've had to go through half a dozen RMAs, including replacements for a Graphic Card, cooling fans, and RAM. You could say this might have been bad luck with bad parts, but CyberpowerPC did plenty to exacerbate this. The fans I had kept breaking down within a few weeks and making a rattling/screeching sound. After this happened with the 2nd kit, I politely asked if I could instead switch to a different brand/model of same or lesser value because this brand kept having the same issue. They said they were unable to change the product and I was forced to get the same fans. This, in itself, was odd because when they replaced my graphics card they were able tosend me a different (and I believe cheaper)model from a different manufacturer.The 3rd set of fans had the same issue as well (surprise, surprise). I pleaded with them that I just wanted working fans, and would take cheaper ones if that meant them working, yet they refused. I sent an e-mail to request yet again a new set of fans 10 days before my 1 year parts warranty expired. At that time I was having other issues and with Tech Support over the phone, they figured it was due to a bad RAM stick. The RMA got submitted, but it was different this time. They didn't \"approve\" cross-ship (this is where they would send me the replacement product first, hold a charge on my credit card, then remove the charge once I mailed back the defective product). This was odd because they \"approved\" this on all my other RMAs. This would enable me to have minimal PC downtime obviously, and I could also see the parts I got as replacements before I sent back my old ones. This is important to remember for what follows.They also wanted to not cover the shipping cost, when I specifically paid for the extra insurance plan with my original order for the 1 year to cover such costs. After bringing this up and some reiterating that it should be covered due to my purchased added coverage, I got a shipping label supplied.About a month from when I shipped my fans and RAM, I received a package from CyberpowerPC. This box had 3 loose fans in bubble wrap, caked in dust, missing their anti-vibration pads, and damaged from what appears to be another install/removal. On top of this, the 2 RAM sticks were open and loose, in the same bubble wrap pouch, free to hit and damage each other in transit. The RAM sticks were scratched and dinged up as well.I contacted CS about this issue, and I was told to refer to their Warranty policy and said they were able to use Refurbished parts to make repairs. I checked the Warranty policy and nowhere does it say they use Refurbished parts. It does say they can use Reconditioned parts, but I don't think these items, in their condition, would qualify as such. Especially considering throughout my year of having these fans, they've broken down very fast, and now I have used/dusty/damaged ones to begin with. Reconditioned by definition has a much higher standard of quality than Refurbished, and these did not meet that standard what-so-ever.I also have a glass case, so having beat up, scratched, damaged parts is not what anyone wants to see on their desk. The parts I sent in were in way better physical condition and packaged much safer than what they had sent back to me.I pointed all of this out to their CS reps, over e-mail and on the phone, and all I've got back, like a robot, is replies like :Hello,Unfortunately, your warranty had ended. We are too far out of the warranty time frame to offer another RMA.A pleasure to be of service,Kindest regardThey are writing me off, sending me junk parts, because they think they can due to my Warranty being expired. I'm continually being told that they can't do another RMA due to my warranty expiration, even though this is obviously in reference to my RMA that is covered under the 1 year warranty. I also believe they didn't approve cross-ship the one and only time because they knew what they were going to send me and I was going to be stuck with this one set of damaged parts.A formal complaint has been filed and I would suggest anyone else to stay away.", "verified_purchase": false}, {"id": "R2EREMAP4SR7QH", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 25, 2020", "date": {"date": "October 25, 2020", "unix": 1603591200}, "name": "Rachel", "rating": 5, "title": "Happy with purchase", "review": "Bought this because I got tired of my gaming laptop, it works very well so far.", "verified_purchase": true}, {"id": "R3T8QWJYM2KYG1", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 25, 2020", "date": {"date": "October 25, 2020", "unix": 1603591200}, "name": "Eugene T. Lovett", "rating": 1, "title": "Not at all what I expected !!!!", "review": "Returned this computer. Took it out of the box. Extremely well packed both outside and inside the computer. Set up the computer - running through all the Microsoft setup. Loaded Dashlane, Quicken and Chrome. Shut the box off and came back and fired it up. At that point the computer stopped working and my monitor started acting like a strobe light. My neighbor's 10 year old walked into my office and started to feel ill. We shut the box off and he felt better in 20 minutes. If I could I would have given this box zero stars.", "verified_purchase": true}, {"id": "R3B2BR4L6RZSWH", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 20, 2020", "date": {"date": "October 20, 2020", "unix": 1603159200}, "name": "Amazon Customer", "rating": 1, "title": "DO NOT BUY", "review": "I bought from cyberpower in 2018 after the 2070 came out because I was playing on a 970m laptop. Do not buy this PC, or any pc, from Cyberpower. They use proprietary hardware from ASRock for their motherboards which means you cannot update the bios at all. From day one I’ve had kernel traps, uncorrectable errors, and pretty much every other BSOD because of the motherboard. I’ve ran every test, every scan, checked every temperature, and everything points to the motherboard which was a Z390 Phantom Gaming 4 CB. ASROCK DOES NOT SUPPORT THE CB MODEL WHATSOEVER AND THEY BARELY ADDED I9 SUPPORT TO THE NORMAL Z390 PG4 A YEAR AGO.After doing a full case swap because the case with a Corsair because the case it comes in is absolutely garbage for airflow with fans that catch dust in a matter of minutes after cleaning them, replacing the cooler with a cooler master liquid cooler, changing the RAM sticks and running memtests, upgrading the PSU, and changing SSDs, I’ve essentially rebuilt my own PC because of the insane idea to put a motherboard in a pc that doesn’t even support the chipset it comes with.Do not buy this pc or any pc from cyberpower. Build your own and do your research otherwise you’re just buying an expensive graphics card. It took me 4 hours to do a case swap because I had to redo everything. Oh, and while we’re talking about case swaps: CYBERPOWER GLUES ON THE SIDE PANEL SO YOU CAN’T OPEN IT. I had to pry the SSD compartment with my hands in order to get it out. I cut myself on it trying to slide it off like it’s SUPPOSED TO DO.Absolutely, unequivocally, garbage.", "verified_purchase": false}, {"id": "R20TQTAE6OQ3YY", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 15, 2020", "date": {"date": "October 15, 2020", "unix": 1602727200}, "name": "Bill W.", "rating": 5, "title": "Great Product", "review": "Bought this to replace an old Alienware Alpha.1) I imagine that these are built in lots (judging from what information I have read) so this can be hit or miss ... I believe I hit.2) Asus motherboard, actual name brand RAM solid main components used (I will have to eventually upgrade the ram but it has enough to get me going).I believe the cost savings is with the case, wiring, liquid cooling (brand used), and power supply utilized (rated at 600w non name brand).16 gig of ram on a \"VR\" machine is low but its enough to start.I was worried (and judging from the questions asked most are) I would have a limitation here.Well I confirm I ramp it up to 64 gig (4x16 so yes there is four slots that accept ram 16 gig ddr 4 @ 3000hrz) which is ideally where it needs to be.Fans are quiet for now, but i suspect as times goes on they will get louder.The LED's on this unit seem gimmicky to me (i am old school .... its not a fish bowl) but can confirm that you can change the color scheme (as i noticed that on the lower units you cant from the reviews).Given the build, the major components, I don't think I could have pieced one together for the price (including the time out of my schedule).", "verified_purchase": true}, {"id": "R228G5XRR212Z5", "asin": {"original": "B0885V5NWD", "variant": ""}, "review_data": "Reviewed in the United States on October 1, 2020", "date": {"date": "October 1, 2020", "unix": 1601517600}, "name": "Moe Elnomany", "rating": 5, "title": "Great so far", "review": "So far the computer has given me no problems. It's fast and elegant. I will be updating this review as I see fit but for now, I have no complaints.", "verified_purchase": true}]}