{"next_page": 2, "reviews": [{"id": "R7V4VKPMU63GE", "asin": {"original": "B08FZRHLFR", "variant": "B08FZSFW6T"}, "review_data": "Reviewed in the United States on October 24, 2020", "date": {"date": "October 24, 2020", "unix": 1603504800}, "name": "Edmond Alexander Green Eugarrios", "rating": 5, "title": "Package was in good condition", "review": "Your browser does not support HTML5 video. Received package everything is going good so far..", "verified_purchase": true}, {"id": "R1HOGAVLF2S6LY", "asin": {"original": "B08FZRHLFR", "variant": "B08FZRHLFR"}, "review_data": "Reviewed in the United States on September 24, 2020", "date": {"date": "September 24, 2020", "unix": 1600912800}, "name": "James Coghlan", "rating": 2, "title": "Good seller, bad memory", "review": "Arrived ahead of schedule and excellent communication with seller but I wasted many hours of time only to discover that the seller-installed ram was defective.I blame the seller for not testing the unit prior to shipping.", "verified_purchase": true}, {"id": "R16B7IETMGY4X9", "asin": {"original": "B08FZRHLFR", "variant": "B08FZRHLFR"}, "review_data": "Reviewed in the United States on September 12, 2020", "date": {"date": "September 12, 2020", "unix": 1599876000}, "name": "William A. Ingram", "rating": 4, "title": "Overheating?", "review": "The laptop works fine most of the time but certain games like World of Warcraft cause it to overheat.The fans turn on and they make a bit of noise as well as blow heat onto your lap.I suppose this is better than having the computer burn up...", "verified_purchase": true}, {"id": "RJ359OC65YQZL", "asin": {"original": "B08FZRHLFR", "variant": "B08FZR417K"}, "review_data": "Reviewed in the United States on September 9, 2020", "date": {"date": "September 9, 2020", "unix": 1599616800}, "name": "mark urban", "rating": 5, "title": "Excellent for video rendering.", "review": "The best computer I have ordered. Everything was great. 2 weeks and runs like a horse. Everything I ordered was un the computer. Received it 2 days early. No complaints.Recommend this to anyone starting out doing videos or pic editing. Premiere Pro Cloud runs great on it.", "verified_purchase": true}, {"id": "R2J27JG0L4RV16", "asin": {"original": "B08FZRHLFR", "variant": "B08FZR417K"}, "review_data": "Reviewed in the United States on September 4, 2020", "date": {"date": "September 4, 2020", "unix": 1599184800}, "name": "Clark Williamson", "rating": 4, "title": "Got sent junk. They company handled the issue and I receive my new computer in a timely manner", "review": "I received my computer 2 days ago. During setup the screen went black. I had to call Dells customer service to receive any help and now I have to send a BRAND NEW COMPUTER in to get fixed. My screen is either black or has pixels. The screen works fine, then will glitch and be pixeled.Update: Returning this computer and purchase same one. Hope this one doesn't have the same issues. I know things like this happen and was probably the >1% error Dell facility had.Update: I have recieved new my computer in a timely manner and it works perfectly. This company stepped up to the plate and fixed issue. Thank you. I use this for Inventer and CAD. It works great for these programs and even with complex assemblies.", "verified_purchase": true}]}