[{"author": "Devilman245", "author_created_utc": 1391164250, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_f282l", "created_utc": 1430035272, "domain": "self.Amd", "full_link": "https://www.reddit.com/r/Amd/comments/33whcs/is_anyone_else_having_issues_with_the_latest_beta/", "gilded": 0, "id": "33whcs", "is_self": true, "link_flair_css_class": "gpu", "link_flair_text": "Discussion", "media_embed": {}, "num_comments": 15, "over_18": false, "permalink": "/r/Amd/comments/33whcs/is_anyone_else_having_issues_with_the_latest_beta/", "retrieved_on": 1443167580, "score": 12, "secure_media_embed": {}, "selftext": "As GTA V was recently released, I thought it was a smart move to get the optimized drivers for the game but know I'm skeptical of the fact that it was a good idea.\n\nSince I installed the drivers, Every so often (About twice a day) My display drivers will crash and instantly recover, Giving me a message saying such.\n\nAt first I put this down to beta drivers will be beta drivers but then I started getting some weird artifacting when using HTML5 players, Such as flickering video and a corrupted taskbar that instantly corrects itself on hover.\n\nI wanted to rule out the possibility of a failing Graphics card because the only ones I have to replace my 270X are a 5850 and a 9600GT.\n\nI have had graphic cards fail in the past and they have been a bit more spectacular in doing so but you never know, This could just be the beginning.\n\nLater tonight, I'll probably downgrade the drivers to test this out seeing as I have completed GTA V on 360 a year prior anyway.\n\nIf this falls under a tech support question then I'll copy it, remove this post and go find someone who cares.  ", "stickied": false, "subreddit": "Amd", "subreddit_id": "t5_2rw0n", "thumbnail": "self", "title": "Is anyone else having issues with the latest beta drivers?", "url": "https://www.reddit.com/r/Amd/comments/33whcs/is_anyone_else_having_issues_with_the_latest_beta/"}]