[{"author": "Arbour84", "author_created_utc": 1318446220, "author_flair_css_class": null, "author_flair_text": null, "author_fullname": "t2_613kk", "created_utc": 1331754407, "domain": "self.Amd", "edited": 1, "full_link": "https://www.reddit.com/r/Amd/comments/qwmdt/amd_7970_support_random_bsods_and_drivers_possibly/", "id": "qwmdt", "is_self": true, "media_embed": {}, "num_comments": 12, "over_18": false, "permalink": "/r/Amd/comments/qwmdt/amd_7970_support_random_bsods_and_drivers_possibly/", "score": 3, "selftext": "** 3/21/12 SOLVED wasn't even the card, the card is perfect, go AMD! **\n\nFirst off, I did not know r/amd existed till an hour or so ago. Anyway I'm posting in here because I've tried my hand at google and some forums and haven't had any luck with the issue I am having.\n\nI just built a new rig and got an AMD 7970 for it.\n\nThis is my setup\n\nWindows 7 x64\nCorsair Force 3 60GB SSD (system goes here C:)\nan Old Dell 500gb hdd ripped out of my old comp (D:)\n4 4gb G.Skill Ripjaw (16gb total)\ni7 2600 Sandy Bridge 3.4ghz\nAsrock Z68 extreme3 gen3 mobo\nand a Sapphire 7970 \n\nas well as a 700w psu and a cooler, but I highly doubt those might be the problem.\n\nSo I install windows, mobo drivers, and then use AMD auto update and find my graphics drivers. I can get everything installed but after installing the drivers I can go maybe 10 minutes before it BSODs and shuts down. It centers around BCcode 1e and 3b for the majority of the bsods.\n\nI've ran memtest86 and checked all kinds of stuff. I've installed RC11 drivers and tried multiple approaches through google searches but to no avail.\n\nI found the AMD post about drivers for new 7970 cards for a windows 7 x64 and will try the one he has linked to in the subreddit tonight. So I'm asking, has anybody else had an issue like this and if they have, what/how/can I fix it?\n\nI'm not asking for any kind of super technical help, I kind of fit the \"more money than sense\" aspect of the 7970 and am just curious as to what I can do or if there is anything I can do. Thanks ahead of time!\n\n\nUPDATE: It turns out the LAN port on the motherboard was bad, so I'm replacing that. The card was fine, can't wait to get this bad boy up and running.\n\nUPDATE 3/21/12:Replaced the motherboard with a brand new board. Card and drivers installed and running Skyrim on Ultra everything turned on WITH the HD textures from Bethesda. Gorgeous, absolutely gorgeous.\n\nSo, Thanks for all the responses but it wasn't even the card that was the problem, it was the motherboard. Planning on benchmarking stock speeds tonight, anybody want to see what I can pump out? I'm probably going to run Heaven, any suggestions on a benchmark are welcomed.\n\nLike I said, Thanks for the help guys!", "subreddit": "Amd", "subreddit_id": "t5_2rw0n", "thumbnail": "self", "title": "AMD 7970 Support, random BSODs and drivers possibly.", "url": "http://www.reddit.com/r/Amd/comments/qwmdt/amd_7970_support_random_bsods_and_drivers_possibly/"}]